
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>爸爸和无我编程十条诫律 | 好记性不如烂笔头</title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=3, minimum-scale=1">
    
    <meta name="author" content="LQF">
    
    <meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x5728;&amp;#x7238;&amp;#x7238;&amp;#x53BB;&amp;#x4E16;&amp;#x524D;&amp;#xFF0C;&amp;#x6211;&amp;#x548C;&amp;#x4ED6;&amp;#x8C08;&amp;#x8BBA;&amp;#x4E86;2&amp;#x4E2A;&amp;#x661F;&amp;#x671F;&amp;#x51">
    
    
    
    
    
    <link rel="icon" href="/img/lqf.ico">
    
    
    <link rel="apple-touch-icon" href="/img/pacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/pacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">
</head>

  <body>
    <header>
      <div>
		
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="好记性不如烂笔头">好记性不如烂笔头</a></h1>
				<h2 class="blog-motto">不以其昏昏而使人昭昭</h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">首页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/about">关于</a></li>
					
					<li>
					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="text" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:mysterier.github.io">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2014/07/22/dad-and-the-ten-commandments-of-egoless-programming/" title="爸爸和无我编程十条诫律" itemprop="url">爸爸和无我编程十条诫律</a>
  </h1>
  <p class="article-author">By
    
      <a href="http://mysterier.github.io" title="LQF">LQF</a>
    </p>
  <p class="article-time">
    <time datetime="2014-07-22T06:13:44.000Z" itemprop="datePublished">7月 22 2014</time>
    更新日期:<time datetime="2014-07-22T07:36:08.000Z" itemprop="dateModified">7月 22 2014</time>
    
  </p>
</header>
	<div class="article-content">
		
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
		</div>
		
		<p>&#x2003;&#x2003;&#x5728;&#x7238;&#x7238;&#x53BB;&#x4E16;&#x524D;&#xFF0C;&#x6211;&#x548C;&#x4ED6;&#x8C08;&#x8BBA;&#x4E86;2&#x4E2A;&#x661F;&#x671F;&#x5173;&#x4E8E;&#x7F16;&#x7A0B;&#x7684;&#x4E8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6211;22&#x5C81;&#xFF0C;&#x4E00;&#x4E2A;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x653B;&#x8BFB;&#x7F8E;&#x672F;&#x8BBE;&#x8BA1;&#x7684;&#x56DB;&#x5E74;&#x7EA7;&#x7684;&#x5B66;&#x751F;&#x3002;&#x7238;&#x7238;62&#x5C81;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x8001;&#x7684;&#x7238;&#x7238;&#x3002;&#x65E9;&#x5728;&#x4E16;&#x7EAA;60&#x5E74;&#x4EE3;&#x4ED6;&#x5C31;&#x5728;&#x7530;&#x7EB3;&#x897F;&#x7406;&#x5DE5;&#x5927;&#x5B66;&#x7F16;&#x7A0B;&#xFF0C;&#x4ED6;&#x5728;&#x6253;&#x5B54;&#x7EB8;&#x5E26;&#x4E0A;&#x505A;FORTRAN&#x5F00;&#x53D1;&#x3002;&#x4ED6;&#x77E5;&#x8BC6;&#x4E30;&#x5BCC;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x4E2A;&#x5B66;&#x671F;&#x6211;&#x624D;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x6211;&#x7684;&#x6574;&#x4E2A;&#x8111;&#x5B50;&#x5168;&#x88AB;&#x5B83;&#x5438;&#x5F15;&#x4F4F;&#x4E86;&#x3002;&#x7F16;&#x7A0B;&#x5F88;&#x795E;&#x5947;&#xFF0C;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x65B9;&#x9762;&#x6BD4;&#x56FE;&#x50CF;&#x8BBE;&#x8BA1;&#x66F4;&#x5BCC;&#x521B;&#x9020;&#x6027;(&#x6211;&#x4F1A;&#x5728;&#x53E6;&#x5916;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#x8C08;&#x8BBA;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;)&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x6211;&#x5047;&#x671F;&#x56DE;&#x5230;&#x5BB6;&#x65F6;&#xFF0C;&#x7238;&#x7238;&#x5411;&#x6211;&#x5206;&#x4EAB;&#x4E86;<em>&#x65E0;&#x6211;&#x7F16;&#x7A0B;&#x7684;&#x5341;&#x6761;&#x8BEB;&#x5F8B;</em>&#x3002;&#x4ED6;&#x628A;&#x5B83;&#x6253;&#x5370;&#x51FA;&#x6765;&#xFF0C;&#x9010;&#x6761;&#x548C;&#x6211;&#x8BA8;&#x8BBA;&#x3002;&#x8FD9;&#x662F;&#x5728;&#x4ED6;&#x610F;&#x5916;&#x53BB;&#x4E16;&#x524D;&#x6211;&#x4EEC;&#x4EC5;&#x6709;&#x7684;&#x5173;&#x4E8E;&#x7F16;&#x7A0B;&#x7684;&#x8BA8;&#x8BBA;&#x3002;&#x4E5F;&#x8BB8;&#x8FD9;&#x662F;&#x8BA9;&#x6211;&#x5BF9;&#x6B64;&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6765;&#x81EA;&#x5199;&#x4E8E;1971&#x5E74;&#x7684;&#x300A;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x5FC3;&#x7406;&#x5B66;(The Psychology of Computer Programming)&#x300B;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x662F;&#x8FD9;&#x65E0;&#x6211;&#x7F16;&#x7A0B;&#x5341;&#x6761;&#x8BEB;&#x5F8B;&#xFF1A;</p>
<ol>
<li>&#x7406;&#x89E3;&#x548C;&#x63A5;&#x53D7;&#x81EA;&#x5DF1;&#x4F1A;&#x72AF;&#x9519;&#x8BEF;&#x3002;&#x5173;&#x952E;&#x662F;&#x8981;&#x5C3D;&#x65E9;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x9519;&#x8BEF;&#x8FDB;&#x5165;&#x5230;&#x6700;&#x7EC8;&#x4EA7;&#x54C1;&#x524D;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x9664;&#x4E86;&#x6211;&#x4EEC;&#x5C11;&#x6570;&#x51E0;&#x4E2A;&#x5728;&#x55B7;&#x6C14;&#x63A8;&#x8FDB;&#x5B9E;&#x9A8C;&#x6240;&#x5F00;&#x53D1;&#x706B;&#x7BAD;&#x5BFC;&#x822A;&#x7CFB;&#x7EDF;&#x7684;&#x4EBA;&#x5916;&#xFF0C;&#x5728;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x4E2D;&#x72AF;&#x9519;&#x8BEF;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x707E;&#x96BE;&#x6027;&#x4E8B;&#x6545;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x4ECE;&#x9519;&#x8BEF;&#x4E2D;&#x5438;&#x53D6;&#x6559;&#x8BAD;&#xFF0C;&#x5FAE;&#x7B11;&#xFF0C;&#x5E76;&#x7EE7;&#x7EED;&#x524D;&#x8FDB;&#x3002;</li>
<li>&#x4F60;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8BB0;&#x4F4F;&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x7684;&#x5168;&#x90E8;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x53BB;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x76F8;&#x4FE1;&#x95EE;&#x9898;&#x4F1A;&#x88AB;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x3002;&#x5F53;&#x6709;&#x95EE;&#x9898;&#x758F;&#x6F0F;&#x65F6;&#x4E0D;&#x8981;&#x81EA;&#x8D23;&#x3002;</li>
<li>&#x4E0D;&#x7BA1;&#x4F60;&#x5BF9;&#x201C;&#x7A7A;&#x624B;&#x9053;&#x201D;&#x6709;&#x591A;&#x4E86;&#x89E3;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x7684;&#x66F4;&#x591A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53BB;&#x95EE;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4F60;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x62DB;&#x6570;&#x3002;&#x4ECE;&#x522B;&#x4EBA;&#x90A3;&#x91CC;&#x5BFB;&#x627E;&#x548C;&#x63A5;&#x53D7;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x90A3;&#x4E9B;&#x4F60;&#x8BA4;&#x4E3A;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x77E5;&#x8BC6;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x5728;&#x6CA1;&#x6709;&#x8BA8;&#x8BBA;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x91CD;&#x5199;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x201C;&#x8C03;&#x6574;&#x4EE3;&#x7801;&#x201D;&#x548C;&#x201C;&#x91CD;&#x5199;&#x4EE3;&#x7801;&#x201D;&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x6761;&#x5F88;&#x7EC6;&#x81F4;&#x7684;&#x754C;&#x9650;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x7684;&#x5236;&#x5EA6;&#x4E0B;&#x505A;&#x98CE;&#x683C;&#x4E0A;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x4E0D;&#x8981;&#x72EC;&#x65AD;&#x4E13;&#x884C;&#x3002;</li>
<li>&#x5BF9;&#x90A3;&#x4E9B;&#x4E0D;&#x5982;&#x4F60;&#x7684;&#x4EBA;&#x8981;&#x5C0A;&#x656C;&#xFF0C;&#x793C;&#x9047;&#xFF0C;&#x6709;&#x8010;&#x5FC3;&#x3002;&#x7ECF;&#x5E38;&#x8DDF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x975E;&#x6280;&#x672F;&#x4EBA;&#x58EB;&#x901A;&#x5E38;&#x6301;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x89C2;&#x70B9;&#xFF1A;&#x7A0B;&#x5E8F;&#x5458;&#x51ED;&#x501F;&#x4E00;&#x6280;&#x4E4B;&#x957F;&#x72C2;&#x653E;&#x4E0D;&#x7F81;&#x3002;&#x4E0D;&#x8981;&#x8BA9;&#x4F60;&#x7684;&#x53D1;&#x6012;&#x548C;&#x7F3A;&#x4E4F;&#x8010;&#x6027;&#x8BA9;&#x4ED6;&#x4EEC;&#x5FC3;&#x4E2D;&#x7684;&#x8FD9;&#x79CD;&#x5F62;&#x8C61;&#x52A0;&#x6DF1;&#x3002;</li>
<li>&#x8FD9;&#x4E16;&#x754C;&#x4E0A;&#x552F;&#x4E00;&#x4E0D;&#x53D8;&#x7684;&#x5C31;&#x662F;&#x53D8;&#x5316;&#x3002;&#x5F00;&#x653E;&#x601D;&#x8003;&#xFF0C;&#x9762;&#x5E26;&#x5FAE;&#x7B11;&#x7684;&#x63A5;&#x53D7;&#x5B83;&#x3002;&#x628A;&#x9700;&#x6C42;&#x4E0A;&#x3001;&#x5E73;&#x53F0;&#x6216;&#x5DE5;&#x5177;&#x91CC;&#x7684;&#x6BCF;&#x4E2A;&#x6539;&#x53D8;&#x90FD;&#x89C6;&#x4F5C;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x4F5C;&#x5927;&#x9EBB;&#x70E6;&#x6765;&#x62B5;&#x5236;&#x3002;</li>
<li>&#x771F;&#x6B63;&#x7684;&#x6743;&#x5A01;&#x6765;&#x81EA;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x804C;&#x4F4D;&#x3002;&#x77E5;&#x8BC6;&#x9020;&#x5C31;&#x6743;&#x5A01;&#xFF0C;&#x6743;&#x5A01;&#x5E26;&#x6765;&#x5C0A;&#x656C;&#x2014;&#x2014;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5728;&#x4E00;&#x4E2A;&#x65E0;&#x79C1;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x83B7;&#x5F97;&#x5C0A;&#x656C;&#xFF0C;&#x53BB;&#x57F9;&#x517B;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x5427;&#x3002;</li>
<li>&#x4E3A;&#x4FE1;&#x4EF0;&#x594B;&#x6597;&#xFF0C;&#x4F46;&#x6211;&#x6587;&#x96C5;&#x7684;&#x63A5;&#x53D7;&#x5931;&#x8D25;&#x3002;&#x8981;&#x7406;&#x89E3;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F60;&#x7684;&#x60F3;&#x6CD5;&#x4F1A;&#x88AB;&#x62D2;&#x7EDD;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x8981;&#x62A5;&#x590D;&#x6216;&#x8BF4;&#x201C;I told you so.&#x201D;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x8BA9;&#x4F60;&#x5FC3;&#x7231;&#x7684;&#x88AB;&#x629B;&#x5F03;&#x7684;&#x60F3;&#x6CD5;&#x53D8;&#x6210;&#x6B89;&#x9053;&#x8005;&#x6216;&#x62B1;&#x6028;&#x7D20;&#x6750;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x6210;&#x4E3A;&#x201C;&#x89D2;&#x843D;&#x91CC;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x201D;&#x4E0D;&#x8981;&#x6210;&#x4E3A;&#x9690;&#x85CF;&#x5728;&#x9ED1;&#x6697;&#x529E;&#x516C;&#x5BA4;&#x91CC;&#x3001;&#x53EA;&#x56E0;&#x4E3A;&#x53E3;&#x6E34;&#x624D;&#x51FA;&#x73B0;&#x7684;&#x4EBA;&#x3002;&#x85CF;&#x5728;&#x89D2;&#x843D;&#x7684;&#x91CC;&#x7A0B;&#x5E8F;&#x5458;&#x77ED;&#x89C6;&#x3001;&#x4E0E;&#x4E16;&#x9694;&#x7EDD;&#x3001;&#x4E0D;&#x53D7;&#x63A7;&#x5236;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x5728;&#x516C;&#x5F00;&#x7684;&#x3001;&#x5408;&#x4F5C;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x4E2D;&#x53D1;&#x4E0D;&#x51FA;&#x58F0;&#x97F3;&#x3002;&#x53C2;&#x4E0E;&#x5230;&#x4EA4;&#x6D41;&#x4E2D;&#xFF0C;&#x6210;&#x4E3A;&#x4F60;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x56E2;&#x4F53;&#x4E2D;&#x7684;&#x4E00;&#x5458;&#x3002;</li>
<li>&#x6279;&#x8BC4;&#x4EE3;&#x7801;&#x800C;&#x4E0D;&#x662F;&#x4EBA;&#x2014;&#x2014;&#x5BF9;&#x7F16;&#x7801;&#x4EBA;&#x53CB;&#x5584;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x5BF9;&#x4EE3;&#x7801;&#x53CB;&#x5584;&#x3002;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8BA9;&#x4F60;&#x7684;&#x6279;&#x8BC4;&#x5177;&#x6709;&#x79EF;&#x6781;&#x6027;&#xFF0C;&#x4EE5;&#x6539;&#x8FDB;&#x4EE3;&#x7801;&#x4E3A;&#x76EE;&#x6807;&#x3002;&#x6279;&#x8BC4;&#x8981;&#x8054;&#x7CFB;&#x672C;&#x5730;&#x6807;&#x51C6;&#xFF0C;&#x7F16;&#x7A0B;&#x89C4;&#x683C;&#x6587;&#x6863;&#x548C;&#x63D0;&#x9AD8;&#x540E;&#x7684;&#x6027;&#x80FD;&#x7B49;&#x3002;</li>
</ol>
<p>&#x2003;&#x2003;&#x8FD9;&#x4E2A;&#x5341;&#x6761;&#x8BEB;&#x5F8B;&#x81F3;&#x4ECA;&#x4F34;&#x968F;&#x8FD9;&#x6211;&#x3002;&#x5B83;&#x8BA9;&#x6211;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x540D;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x6709;&#x65F6;&#x6211;&#x5728;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x7238;&#x7238;&#x8FD8;&#x5728;&#x6211;&#x8EAB;&#x8FB9;&#xFF0C;&#x4ED6;&#x8FD8;&#x4F1A;&#x7ED9;&#x6211;&#x54EA;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF1F;&#x867D;&#x7136;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4F46;&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x4ED6;&#x4F1A;&#x4E3A;&#x6211;&#x4E00;&#x76F4;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E9B;&#x800C;&#x9AD8;&#x5174;&#x7684;&#x3002;</p>
  
	</div>
		<footer class="article-footer clearfix">

  <div class="article-tags">
  
  <span></span> <a href="/tags/好文/">好文</a>
  </div>


<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/blog/">blog</a>
</div>



<div class="article-share" id="share">

  <div data-url="http://mysterier.github.io/2014/07/22/dad-and-the-ten-commandments-of-egoless-programming/" data-title="爸爸和无我编程十条诫律 | 好记性不如烂笔头" data-tsina="null" class="share clearfix">
  </div>

</div>
</footer>   	       
	</article>
	
<nav class="article-nav clearfix">
 

<div class="next">
<a href="/2014/06/11/hello-world/"  title="Hello World">
 <strong>下一篇:</strong><br/> 
 <span>Hello World
</span>
</a>
</div>

</nav>

	
<section class="comment">
	<div class="ds-thread"></div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
  
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
			<li><a href="/categories/blog/" title="blog">blog<sup>1</sup></a></li>
		
		</ul>
</div>


  
  <div class="archiveslist">
    <p class="asidetitle"><a href="/archives">归档</a></p>
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/07">七月 2014</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/06">六月 2014</a><span class="archive-list-count">1</span></li></ul>
  </div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			<li><a href="/tags/好文/" title="好文">好文<sup>1</sup></a></li>
		
		</ul>
</div>


  
  <div class="tagcloudlist">
    <p class="asidetitle">标签云</p>
    <div class="tagcloudlist clearfix">
       <a href="/tags/好文/" style="font-size: NaNpx;">好文</a>
    </div>
  </div>


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> I don&#39;t know if we each have a destiny,  <br/>
			or if we&#39;re all just floating around accidentally―like on a breeze. </p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
	</div>
		<p class="copyright">Powered by <a href="http://zespia.tw/hexo/" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/A-limon/pacman" target="_blank" title="Pacman">Pacman</a> © 2014 
		
		<a href="http://mysterier.github.io" target="_blank" title="LQF">LQF</a>
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.1.0.min.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else
    {
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      h  = $('article h2')
      ah = $('article h2'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  if(ah.length==0){
    t.css('display','none');
  }else{
    c.click(function(){
      ta.css('display', 'block').addClass('fadeIn');
    });
    o.click(function(){
      ta.css('display', 'none');
    });
    $(window).scroll(function(){
      ta.css("top",Math.max(140,320-$(this).scrollTop()));
    });
  };
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina');
  var html = [
  '<a href="#" class="overlay" id="qrcode"></a>',
  '<div class="qrcode clearfix"><span>扫描二维码分享到微信朋友圈</span><a class="qrclose" href="#share"></a><strong>Loading...Please wait</strong><img id="qrcode-pic" data-src="http://s.jiathis.com/qrcode.php?url=' + encodedUrl + '"/></div>',
  '<a href="#textlogo" class="article-back-to-top" title="Top"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="QRcode"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="Weibo"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);
  $('.article-share-qrcode').click(function(){
    var imgSrc = $('#qrcode-pic').attr('data-src');
    $('#qrcode-pic').attr('src', imgSrc);
    $('#qrcode-pic').load(function(){
        $('.qrcode strong').text(' ');
    });
  });
});     
</script>


<script type="text/javascript">
  var duoshuoQuery = {short_name:"mysterier"};
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] 
    || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script> 





  </body>
</html>
